; domain
(define (domain blocksworld)
    (:requirements :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block) ; observed predicate
        (ontable ?x - block)  ; derived predicate
        (clear ?x - block)  ; derived predicate
        (handempty ?x - robot)  ; derived predicate
        (handfull ?x - robot)  ; derived predicate
        (holding ?x - block) ; derived predicate
    )
    (:action pick_up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put_down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld6)
(:domain blocksworld)
(:objects
    colored_block2 - block 
    arm - robot 
    yellow_block - block 
    orange_block - block 
    purple_block - block 
    pink_block - block 
)

(:init
    ( clear orange_block )
    ( clear purple_block )
    ( handempty arm )
    ( on orange_block colored_block2 )
    ( on pink_block yellow_block )
    ( on purple_block pink_block )
    ( ontable colored_block2 )
    ( ontable yellow_block )
)

    (:goal (and (on pink_block purple_block) (on yellow_block orange_block) (clear yellow_block) (clear pink_block)))
)

; plan
1. (unstack purple_block pink_block arm)
   deleted: (clear purple_block) (handempty arm) (on purple_block pink_block)
   added: (holding purple_block) (clear pink_block) (handfull arm)
   goals met: 1 of 4
2. (put_down purple_block arm)
   deleted: (holding purple_block) (handfull arm)
   added: (clear purple_block) (handempty arm) (ontable purple_block)
   goals met: 1 of 4
3. (unstack pink_block yellow_block arm)
   deleted: (clear pink_block) (handempty arm) (on pink_block yellow_block)
   added: (holding pink_block) (clear yellow_block) (handfull arm)
   goals met: 1 of 4
4. (stack pink_block purple_block arm)
   deleted: (holding pink_block) (clear purple_block) (handfull arm)
   added: (clear pink_block) (handempty arm) (on pink_block purple_block)
   goals met: 3 of 4
5. (pick_up yellow_block arm)
   deleted: (ontable yellow_block) (clear yellow_block) (handempty arm)
   added: (handfull arm) (holding yellow_block)
   goals met: 2 of 4
6. (stack yellow_block orange_block arm)
   deleted: (holding yellow_block) (clear orange_block) (handfull arm)
   added: (clear yellow_block) (handempty arm) (on yellow_block orange_block)
   goals met: 4 of 4
